CSI API ETABS v1

# cDCoACI318_14GetOverwrite Method

---

Retrieves the value of a concrete design overwrite item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOverwrite(
    	string Name,
    	int Item,
    	ref double Value,
    	ref bool ProgDet
    )

    Function GetOverwrite (
    	Name As String,
    	Item As Integer,
    	ByRef Value As Double,
    	ByRef ProgDet As Boolean
    ) As Integer

    Dim instance As cDCoACI318_14
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ProgDet As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetOverwrite(Name,
    	Item, Value, ProgDet)

    int GetOverwrite(
    	String^ Name,
    	int Item,
    	double% Value,
    	bool% ProgDet
    )

    abstract GetOverwrite :
            Name : string *
            Item : int *
            Value : float byref *
            ProgDet : bool byref -> int

#### Parameters

Name

    Type: SystemString
The name of a frame object with a concrete frame design procedure.

Item

    Type: SystemInt32
This is an integer between 1 and 13, inclusive, indicating the overwrite item
considered.

  1. Framing type
  2. Live load reduction factor
  3. Unbraced length ratio, Major
  4. Unbraced length ratio, Minor
  5. Effective length factor, K Major
  6. Effective length factor, K Minor
  7. Moment coefficient, Cm Major
  8. Moment coefficient, Cm Minor
  9. Nonsway moment factor, Db Major
  10. Nonsway moment factor, Db Minor
  11. Sway moment factor, Ds Major
  12. Sway moment factor, Ds Minor
  13. Consider Minimum Eccentricity

Value

    Type: SystemDouble
The value of the considered overwrite item.

  1. Framing type
     * 0 = Program Default
     * 1 = Sway special
     * 2 = Sway Intermediate
     * 3 = Sway Ordinary
     * 4 = Non-sway
  2. Live load reduction factor

Value >= 0; 0 means use program determined value

  3. Unbraced length ratio, Major

Value >= 0; 0 means use program determined value

  4. Unbraced length ratio, Minor

Value >= 0; 0 means use program determined value

  5. Effective length factor, K Major

Value >= 0; 0 means use program determined value

  6. Effective length factor, K Minor

Value >= 0; 0 means use program determined value

  7. Moment coefficient, Cm Major

Value >= 0; 0 means use program determined value

  8. Moment coefficient, Cm Minor

Value >= 0; 0 means use program determined value

  9. Nonsway moment factor, Db Major

Value >= 0; 0 means use program determined value

  10. Nonsway moment factor, Db Minor

Value >= 0; 0 means use program determined value

  11. Sway moment factor, Ds Major

Value >= 0; 0 means use program determined value

  12. Sway moment factor, Ds Minor

Value >= 0; 0 means use program determined value

  13. Consider Minimum Eccentricity

0 = No

Any other value = Yes

ProgDet

    Type: SystemBoolean
If this item is True, the specified value is program determined.

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("ACI 318-14")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'get overwrite item
       ret = SapModel.DesignConcrete.ACI318_14.GetOverwrite("8", 1, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoACI318_14 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com